[
    {
        "word": "Abandon",
        "definition": "To give up completely; to desert",
        "example": "The captain gave the order to abandon the sinking ship."
    },
    {
        "word": "Keen",
        "definition": "Sharp or penetrating; showing eagerness or enthusiasm",
        "example": "He has a keen sense of observation."
    },
    {
        "word": "Jealous",
        "definition": "Feeling or showing envy of someone or their achievements and advantages",
        "example": "She was jealous of her friend's success."
    },
    {
        "word": "Tact",
        "definition": "Skill and sensitivity in dealing with others or with difficult issues",
        "example": "His tact and diplomacy helped him settle the dispute."
    },
    {
        "word": "Oath",
        "definition": "A solemn promise, often invoking a divine witness, regarding one's future action or behavior",
        "example": "The witness took an oath to tell the truth."
    },
    {
        "word": "Vacant",
        "definition": "Not occupied; empty",
        "example": "The house had been vacant for months."
    },
    {
        "word": "Hardship",
        "definition": "Severe suffering or deprivation",
        "example": "They faced many hardships during the war."
    },
    {
        "word": "Gallant",
        "definition": "Brave, heroic; showing respect for women",
        "example": "The gallant knight saved the princess."
    },
    {
        "word": "Data",
        "definition": "Facts and statistics collected together for reference or analysis",
        "example": "The scientist analyzed the data from the experiment."
    },
    {
        "word": "Unaccustomed",
        "definition": "Not familiar or usual; out of the ordinary",
        "example": "She was unaccustomed to the warm climate."
    },
    {
        "word": "Bachelor",
        "definition": "A man who is not and has never been married",
        "example": "He remained a bachelor for most of his life."
    },
    {
        "word": "Qualify",
        "definition": "To be entitled to a particular benefit or privilege by fulfilling a necessary condition",
        "example": "She qualified for the position after passing the exams."
    },
    {
        "word": "Corpse",
        "definition": "A dead body, especially of a human being",
        "example": "The corpse was found in an abandoned building."
    },
    {
        "word": "Conceal",
        "definition": "To hide or keep from sight",
        "example": "She concealed the letter in a drawer."
    },
    {
        "word": "Dismal",
        "definition": "Depressing; dreary",
        "example": "The weather was dismal, making everyone feel gloomy."
    },
    {
        "word": "Frigid",
        "definition": "Very cold in temperature",
        "example": "The frigid air made it hard to stay outside for long."
    },
    {
        "word": "Inhabit",
        "definition": "To live in or occupy a place",
        "example": "Polar bears inhabit the Arctic region."
    },
    {
        "word": "Numb",
        "definition": "Deprived of the power of sensation",
        "example": "His fingers were numb from the cold."
    },
    {
        "word": "Peril",
        "definition": "Serious and immediate danger",
        "example": "The explorers were in peril when the storm hit."
    },
    {
        "word": "Recline",
        "definition": "To lean or lie back in a relaxed position",
        "example": "She reclined on the sofa with a book."
    },
    {
        "word": "Shriek",
        "definition": "To utter a high-pitched piercing sound or words, especially as an expression of terror, pain, or excitement",
        "example": "He shrieked when he saw the spider."
    },
    {
        "word": "Sinister",
        "definition": "Giving the impression that something harmful or evil is happening or will happen",
        "example": "The abandoned house had a sinister atmosphere."
    },
    {
        "word": "Tempt",
        "definition": "To entice someone to do something they find attractive but know to be wrong or unwise",
        "example": "The offer of free tickets tempted her to go to the concert."
    },
    {
        "word": "Wager",
        "definition": "To risk something, such as money, on the outcome of a contest or any uncertain event; bet",
        "example": "He wagered on his favorite team to win the game."
    }
]
